dinga1981/esp8266-ai/firmware/src/main.cpp
  html += "<form method='POST' action='/reset-wifi' onsubmit=\"return confirm('清除 WiFi "
          "设置并重启？设备会开启配网热点。');\">";
  html += "<button type='submit' style='background:#dc2626'>重置 WiFi</button>";
  html += "</form>";

  html += "</body></html>";
  webServer.send(200, "text/html", html);
}

void handleSave() {
  String newHost = webServer.arg("bridge");
  newHost.trim();
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[web] bridge host updated to '%s'\n", bridgeHost.c_str());
  webServer.sendHeader("Location", "/");
  webServer.send(303);
}

// ---------- JSON API for the Mac app ----------

const char *displayModeName(DisplayMode m) {
  if (m == MODE_CLAUDE) return "claude";
  if (m == MODE_CODEX) return "codex";
  if (m == MODE_NET) return "net";
  if (m == MODE_MUSIC) return "music";
  if (m == MODE_STOCK) return "stock";
  if (m == MODE_MARKET) return "market";
  return "auto";
}

void handleApiInfo() {
  JsonDocument doc;
  doc["ip"] = WiFi.localIP().toString();
  doc["ssid"] = WiFi.SSID();
  doc["bridge"] = bridgeHost;
  doc["mode"] = displayModeName(displayMode);           // configured mode
  doc["effective"] = displayModeName(effectiveMode());   // what's on screen now
  doc["music_playing"] = statusMusicPlaying;
  doc["showing"] = (currentApp == APP_CLAUDE) ? "claude" : "codex";
  doc["last_update_s"] = everPolled ? (long)((millis() - lastSuccessMs) / 1000) : -1;
  doc["sprite_rev"] = spriteRev;
  doc["brightness"] = brightness;
  doc["wired"] = wiredActive(); // true = data currently arrives over USB serial
  doc["fw"] = FW_VERSION;
  doc["auto_seconds"] = autoCycleSeconds;
  JsonArray autoPages = doc["auto_pages"].to<JsonArray>();
  for (uint8_t mode = MODE_CLAUDE; mode <= MODE_MARKET; ++mode) {
    if (autoPageMask & (1U << mode)) autoPages.add(displayModeName((DisplayMode)mode));
  }
  JsonObject c = doc["claude"].to<JsonObject>();
  c["status"] = claudeStatus.status;
  c["custom_sprite"] = claudeCustom;
  c["w"] = CLAUDE_SPRITE_W;
  c["h"] = CLAUDE_SPRITE_H;
  JsonObject x = doc["codex"].to<JsonObject>();
  x["status"] = codexStatus.status;
  x["custom_sprite"] = codexCustom;
  x["w"] = CODEX_SPRITE_W;
  x["h"] = CODEX_SPRITE_H;
  String out;
  serializeJson(doc, out);
  webServer.send(200, "application/json", out);
}

void handleApiDisplay() {
  String mode = webServer.arg("mode");
  if (mode == "auto") {
    displayMode = MODE_AUTO;
    resetAutoCyclePosition();
    lastEffectiveMode = MODE_AUTO; // effective carousel pages never equal AUTO
  }
  else if (mode == "claude") displayMode = MODE_CLAUDE;
  else if (mode == "codex") displayMode = MODE_CODEX;
  else if (mode == "net") displayMode = MODE_NET;
  else if (mode == "music") displayMode = MODE_MUSIC;
  else if (mode == "stock") displayMode = MODE_STOCK;
  else if (mode == "market") displayMode = MODE_MARKET;
  else {
    webServer.send(400, "text/plain", "mode must be auto|claude|codex|net|music|stock|market");
    return;
  }
  Serial.printf("[api] display mode = %s\n", mode.c_str());
  if (displayMode == MODE_AUTO) {
    // loop() performs the first selected page's normal transition atomically.
  } else if (displayMode == MODE_NET) {
    netChromeDrawn = false;
    lastNetPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MUSIC) {
    musicChromeDrawn = false;
    lastMusicPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_STOCK) {
    stockChromeDrawn = false;
    lastStockPollMs = 0; // poll + draw on the next loop tick
  } else if (displayMode == MODE_MARKET) {
    lastMarketPollMs = 0;
    lastMarketFrameVersion = 0; // force a redraw when returning from another page
  } else {
    updateActiveApp();
    drawActiveApp(); // unconditional: also repaints over a previous net chart
  }
  webServer.send(200, "text/plain", "ok");
}

void handleApiAutoCycle() {
  String pages = webServer.arg("pages");
  const int seconds = webServer.arg("seconds").toInt();
  uint8_t mask = 0;
  while (pages.length() > 0) {
    int comma = pages.indexOf(',');
    String page = comma >= 0 ? pages.substring(0, comma) : pages;
    pages = comma >= 0 ? pages.substring(comma + 1) : "";
    page.trim();
    if (page == "claude") mask |= 1U << MODE_CLAUDE;
    else if (page == "codex") mask |= 1U << MODE_CODEX;
    else if (page == "net") mask |= 1U << MODE_NET;
    else if (page == "music") mask |= 1U << MODE_MUSIC;
    else if (page == "stock") mask |= 1U << MODE_STOCK;
    else if (page == "market") mask |= 1U << MODE_MARKET;
    else if (page.length() > 0) {
      webServer.send(400, "text/plain", "unknown auto page: " + page);
      return;
    }
  }
  if (mask == 0) {
    webServer.send(400, "text/plain", "select at least one auto page");
    return;
  }
  if (!validAutoCycleSeconds(seconds)) {
    webServer.send(400, "text/plain", "seconds must be 5|10|30|60|120");
    return;
  }
  autoPageMask = mask;
  autoCycleSeconds = seconds;
  resetAutoCyclePosition();
  saveAutoCycle();
  if (displayMode == MODE_AUTO) lastEffectiveMode = MODE_AUTO;
  Serial.printf("[api] auto pages mask=%u seconds=%u\n", autoPageMask, autoCycleSeconds);
  webServer.send(200, "text/plain", "ok");
}

void handleApiBrightness() {
  String levelArg = webServer.arg("level");
  if (levelArg.length() == 0) {
    webServer.send(400, "text/plain", "missing level (0-100)");
    return;
  }
  int level = levelArg.toInt();
  if (level < 0) level = 0;
  if (level > 100) level = 100;
  brightness = level;
  applyBrightness();
  saveBrightness();
  Serial.printf("[api] brightness = %d\n", brightness);
  webServer.send(200, "text/plain", "ok");
}

void handleApiBridge() {
  String newHost = webServer.arg("host");
  newHost.trim();
  if (newHost.length() == 0) {
    webServer.send(400, "text/plain", "missing host");
    return;
  }
  bridgeHost = newHost;
  saveBridgeHost(bridgeHost);
  Serial.printf("[api] bridge host = '%s'\n", bridgeHost.c_str());
  webServer.send(200, "text/plain", "ok");
  lastPollMs = 0; // poll the new bridge on the next loop tick
}

